app/Livewire/Pages/Feed/Index.php

    public function render()
    {
        $totalPosts = Post::count();

        $posts = Post::with([
            'author',
            'type',
            'media',
            'likes:id,post_id,user_id',
        ])
            ->withCount(['likes', 'comments'])
            ->latest()
            ->limit($this->perPage)
            ->get();

        return view('pages.feed.index', [
            'posts' => $posts,
            'hasMorePages' => $totalPosts > $posts->count(),
        ]);
---
select count(*) as aggregate from "posts"