app/Livewire/Pages/Feed/Index.php

select "id", "post_id", "user_id" from "likes" where "likes"."post_id" in (109, 186, 254, 421, 554, 670, 747, 782, 1004, 1115)
select * from "post_types" where "post_types"."id" in (1, 2, 3)
select count(*) as aggregate from "posts" where exists (select * from "post_embeddings" where "posts"."id" = "post_embeddings"."post_id")
select "id", "post_id", "user_id" from "likes" where "likes"."post_id" in (1, 2, 6, 7, 8, 9, 11, 13, 27, 28)
---
    public function render()
    {

        $viewerCentroid = auth()->user()?->embedding;

        $query = Post::query()
            ->select('posts.*')
            ->with(['author', 'type', 'media', 'likes:id,post_id,user_id'])
            ->withCount(['likes', 'comments'])
            ->join('post_embeddings', 'post_embeddings.post_id', '=', 'posts.id');

        if ($viewerCentroid){
            $literal = '['.implode(',', $viewerCentroid).']';
            $query->orderByRaw('post_embeddings.embedding <=> ?::vector', [$literal]);
        } else {
            $query->latest('posts.created_at')->latest('posts.id');
        }

        $totalPosts = Post::whereHas('embedding')->count();

        $posts = $query->limit($this->perPage)->get();