app/Livewire/Pages/Auth/Register.php

insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('Admin', 'admin@teste.com', '$2y$12$rfqe3BoXzqIqlDY4ClL5HeNOpgBqAaooDK0FM2GujY39pZpTHd.wy', '2026-04-22 23:23:11', '2026-04-22 23:23:11') returning "id"
---
    public function register()
    {
        $this->form->validate();

        $user = User::create([
            'name' => $this->form->name,
            'email' => $this->form->email,
            'password' => $this->form->password,
        ]);