app/Observers/LikeObserver.php

select * from "interaction_types" where "slug" = 'like' limit 1
insert into "post_interactions" ("user_id", "post_id", "interaction_type_id", "weight", "created_at") values (304, 125, 1, '1.000', '2026-04-22 00:31:50') returning "id"
---
    public function created(Like $like): void
    {
        $type = InteractionType::where('slug', 'like')->first();

        if ($type !== null) {
            PostInteraction::create([
                'user_id' => $like->user_id,
                'post_id' => $like->post_id,
                'interaction_type_id' => $type->id,
                'weight' => $type->default_weight,
                'created_at' => now(),
            ]);