app/Livewire/Feed/Stories.php

    public function render()
    {
        $users = User::query()
            ->when(auth()->check(), fn ($q) => $q->orderByRaw('CASE WHEN id = ? THEN 0 ELSE 1 END', [auth()->id()]))
            ->orderBy('name')
            ->limit(15)
            ->get();
---
select * from "users" order by CASE WHEN id = 304 THEN 0 ELSE 1 END, "name" asc limit 15