app/Livewire/Feed/Suggestions.php

select * from "users" where "id" != 304 order by RANDOM() limit 5
---
    public function render()
    {
        $currentUser = auth()->user();

        $suggestions = User::query()
            ->when(auth()->check(), fn ($q) => $q->where('id', '!=', auth()->id()))
            ->inRandomOrder()
            ->limit(5)
            ->get();