app/Livewire/Post/CreateModal.php

insert into "posts" ("user_id", "post_type_id", "body", "updated_at", "created_at") values (2, 2, 'Quotation cards do jogo troca da estrela de 1994', '2026-04-22 23:26:17', '2026-04-22 23:26:17') returning "id"
insert into "post_media" ("post_id", "file_path", "sort_order", "updated_at", "created_at") values (3, 'posts/3/images/0-69e95919c06ee.png', 0, '2026-04-22 23:26:18', '2026-04-22 23:26:18') returning "id"
---
    public function submitImages(MediaUploadService $mediaUploadService): void
    {
        abort_unless(auth()->check(), 403);

        $this->imageForm->validate();

        DB::transaction(function () use ($mediaUploadService) {
            $post = Post::create([
                'user_id' => auth()->id(),
                'post_type_id' => $this->postTypeId('image'),
                'body' => $this->imageForm->caption ?: null,
            ]);

            foreach ($this->imageForm->images as $index => $file) {
                $path = $mediaUploadService->storeImage($file, $post->id, $index);

                PostMedia::create([
                    'post_id' => $post->id,
                    'file_path' => $path,
                    'sort_order' => $index,
                ]);

select "id" from "post_types" where "slug" = 'image' limit 1
---
    private function postTypeId(string $slug): int
    {
        return PostType::where('slug', $slug)->value('id')