app/Livewire/Post/LikeButton.php

insert into "likes" ("user_id", "post_id", "updated_at", "created_at") values (304, 125, '2026-04-22 00:31:50', '2026-04-22 00:31:50') returning "id"
select * from "likes" where ("user_id" = 304 and "post_id" = 125) limit 1
select count(*) as aggregate from "likes" where "post_id" = 125
---
    public function toggle(): void
    {
        if (! auth()->check()) {
            $this->redirectRoute('login', navigate: true);

            return;
        }

        if ($this->isLiked) {
            Like::where('user_id', auth()->id())
                ->where('post_id', $this->post->id)
                ->first()
                ?->delete();

            $this->isLiked = false;
            $this->likesCount = max(0, $this->likesCount - 1);

            return;
        }

        Like::firstOrCreate([
            'user_id' => auth()->id(),
            'post_id' => $this->post->id,
        ]);

        $this->isLiked = true;
        $this->likesCount = Like::where('post_id', $this->post->id)->count();