app/Livewire/Post/ShareButton.php

    public function share(): void
    {
        if (! auth()->check()) {
            $this->redirectRoute('login', navigate: true);

            return;
        }

        $type = InteractionType::where('slug', 'share')->first();

        if ($type !== null) {
            PostInteraction::create([
                'user_id' => auth()->id(),
                'post_id' => $this->post->id,
                'interaction_type_id' => $type->id,
                'weight' => $type->default_weight,
                'created_at' => now(),
            ]);
---
select * from "interaction_types" where "slug" = 'share' limit 1
insert into "post_interactions" ("user_id", "post_id", "interaction_type_id", "weight", "created_at") values (302, 693, 4, '2.000', '2026-04-22 00:19:17') returning "id"