app/Livewire/Post/WhyDidISeeThis.php

select * from "recommendation_logs" where "user_id" = 304 and "post_id" = 166 and "filtered_reason" is null order by "created_at" desc limit 1
---
    public function trace(): ?RecommendationLog
    {
        if (! auth()->check()) {
            return null;
        }

        return RecommendationLog::query()
            ->with('source')
            ->where('user_id', auth()->id())
            ->where('post_id', $this->post->id)
            ->whereNull('filtered_reason')
            ->latest('created_at')
            ->first();