app/Services/Recommendation/CandidateGenerator.php

    public function annByClusters(User $user, ?int $totalLimit = null, ?int $perClusterLimit = null): array
    {
        $totalLimit ??= (int) config('recommendation.clusters.global_limit', 300);
        $perClusterLimit ??= (int) config('recommendation.clusters.per_cluster_limit', 100);

        if ($totalLimit <= 0 || $perClusterLimit <= 0) {
            return [];
        }

        $clusters = DB::table('user_interest_clusters')
            ->where('user_id', $user->id)
            ->orderBy('cluster_index')
            ->get(['cluster_index', 'weight', DB::raw('embedding::text as embedding_text')]);
---
select "cluster_index", "weight", embedding::text as embedding_text from "user_interest_clusters" where "user_id" = 304 order by "cluster_index" asc

    public function exploration(User $user, int $limit = 50): array
    {
        $seenAuthorIds = DB::table('post_interactions as pi')
            ->join('posts as p', 'p.id', '=', 'pi.post_id')
            ->where('pi.user_id', $user->id)
            ->distinct()
            ->pluck('p.user_id')
            ->map(static fn ($id) => (int) $id)
            ->all();

        $seenAuthorIds[] = $user->id;

        $rows = DB::table('posts')
            ->select('id', 'user_id', 'created_at')
            ->whereNotNull('embedding')
            ->whereNull('deleted_at')
            ->whereNotIn('user_id', $seenAuthorIds)
            ->orderByDesc('created_at')
            ->orderByDesc('id')
            ->limit($limit)
            ->get();
---
select distinct "p"."user_id" from "post_interactions" as "pi" inner join "posts" as "p" on "p"."id" = "pi"."post_id" where "pi"."user_id" = 304
select "id", "user_id", "created_at" from "posts" where "embedding" is not null and "deleted_at" is null and "user_id" not in (23, 26, 34, 53, 114, 124, 126, 132, 134, 140, 151, 173, 183, 186, 192, 193, 223, 256, 260, 266, 290, 304) order by "created_at" desc, "id" desc limit 50

    private function applyHardFilters(User $user, array $byPost): array
    {
        $reportsThreshold = (int) config('recommendation.candidates.reports_threshold', 3);

        $postIds = array_keys($byPost);

        $metadata = DB::table('posts')
            ->whereIn('id', $postIds)
            ->get(['id', 'user_id', 'embedding', 'deleted_at', 'reports_count'])
            ->keyBy('id');
---
select "id", "user_id", "embedding", "deleted_at", "reports_count" from "posts" where "id" in (713, 559, 1031, 855, 492, 427, 408, 723, 1186, 1082, 853, 494, 172, 791, 124, 459, 881, 982, 1013, 1010, 1156, 1033, 693, 166, 101, 896, 762, 623, 286, 387, 377, 263, 794, 969, 833, 171, 588, 68, 719, 612, 878, 826, 629, 1050, 695, 732, 333, 16, 479, 183, 445, 772, 1150, 718, 1232, 1204, 469, 455, 888, 533, 895, 947, 56, 253, 1066, 1159, 468, 107, 92, 112, 395, 1046, 1096, 125, 174, 589, 24, 971, 245, 32, 219, 108, 1, 522, 72, 211, 932, 857, 873, 185, 249, 236, 52, 667, 198, 36, 1203, 601, 812, 87, 220, 696, 1032, 213, 116, 730, 421, 700, 506, 472, 548, 1021, 65, 904, 861, 790, 519, 965, 592, 1128, 483, 322, 937, 571, 556, 401, 141, 513, 450, 822, 451, 972, 782, 1243, 516, 1221, 17, 1035, 552, 1217, 837, 578, 168, 260, 221, 968, 14, 148, 528, 948, 433, 390, 1210, 394, 912, 1229, 520, 178, 1195, 339, 1215, 827, 151, 741, 1062, 876, 823, 398, 352, 806, 517, 781, 160, 47, 359, 384, 761, 1172, 926, 345, 1226, 1095, 463, 575, 1152, 439, 534, 1127, 379, 908, 670, 843, 1029, 872, 626, 974, 980, 1120, 798, 231, 74, 274, 179, 1245, 473, 264, 3, 1246, 310, 960, 1019, 961, 614, 538, 1002, 252, 596, 1048, 527, 334, 1130, 669, 757, 529, 282, 910, 1239, 6, 946, 96, 38, 1219, 120, 217, 1162, 618, 287, 1100, 605, 229, 850, 797, 637, 658, 902, 783)