app/Services/Recommendation/ClusterCoverageEnforcer.php

    public function enforce(User $user, array $ranked): array
    {
        if ($ranked === []) {
            return $ranked;
        }

        $topK = (int) config('recommendation.clusters.coverage_top_k', 20);
        $minRatio = (float) config('recommendation.clusters.coverage_min_ratio', 0.7);
        $minClusters = (int) config('recommendation.clusters.coverage_min_clusters', 3);

        $clusters = DB::table('user_interest_clusters')
            ->where('user_id', $user->id)
            ->orderBy('cluster_index')
            ->get(['cluster_index', DB::raw('embedding::text as embedding_text')]);
---
select "cluster_index", embedding::text as embedding_text from "user_interest_clusters" where "user_id" = 304 order by "cluster_index" asc