app/Services/Recommendation/ColdStartFeedBuilder.php

    public function build(User $user, int $limit): array
    {
        $recentEvery = (int) config('recommendation.cold_start.recent_per_trending', 5);
        $reportsThreshold = (int) config('recommendation.candidates.reports_threshold', 3);

        $seen = $this->seenFilter->seenFor($user);

        $trendingIds = [];
        foreach ($this->trendingPool->topIds($limit * 2) as $id) {
            if (isset($seen[$id])) {
                continue;
            }
            $trendingIds[] = $id;
        }

        $filterTrending = DB::table('posts')
            ->whereIn('id', $trendingIds === [] ? [0] : $trendingIds)
            ->whereNotNull('embedding')
            ->whereNull('deleted_at')
            ->where('user_id', '!=', $user->id)
            ->where('reports_count', '<', $reportsThreshold)
            ->pluck('id')
            ->map(static fn ($id) => (int) $id)
            ->flip()
            ->all();
---
select "id" from "posts" where "id" in (1221, 359, 693, 392, 8, 823, 995, 527, 1186, 1245, 713, 723, 125, 14, 648, 120, 596, 1171, 429, 43) and "embedding" is not null and "deleted_at" is null and "user_id" != 1 and "reports_count" < 3

            static fn (int $id) => isset($filterTrending[$id]),
        ));

        $recent = DB::table('posts')
            ->select('id')
            ->whereNotNull('embedding')
            ->whereNull('deleted_at')
            ->where('user_id', '!=', $user->id)
            ->where('reports_count', '<', $reportsThreshold)
            ->orderByDesc('created_at')
            ->orderByDesc('id')
            ->limit($limit * 2)
            ->pluck('id')
            ->map(static fn ($id) => (int) $id)
            ->filter(static fn (int $id) => ! isset($seen[$id]))
            ->values()
            ->all();
---
select "id" from "posts" where "embedding" is not null and "deleted_at" is null and "user_id" != 1 and "reports_count" < 3 order by "created_at" desc, "id" desc limit 20

    public function isColdStart(User $user): bool
    {
        if (! empty($user->long_term_embedding)) {
            return false;
        }

        $threshold = (int) config('recommendation.cold_start.interactions_threshold', 5);

        $positiveCount = DB::table('post_interactions as pi')
            ->join('interaction_types as it', 'it.id', '=', 'pi.interaction_type_id')
            ->where('pi.user_id', $user->id)
            ->where('it.is_positive', true)
            ->count();
---
select count(*) as aggregate from "post_interactions" as "pi" inner join "interaction_types" as "it" on "it"."id" = "pi"."interaction_type_id" where "pi"."user_id" = 304 and "it"."is_positive" = 1