app/Services/Recommendation/ExperimentService.php

select * from "recommendation_experiments" where "user_id" = 304 and "experiment_name" = 'random_serving' limit 1
---
    private function persistedVariant(User $user, string $experiment, CarbonImmutable $now): ?string
    {
        $record = RecommendationExperiment::where('user_id', $user->id)
            ->where('experiment_name', $experiment)
            ->first();