app/Services/Recommendation/Ranker.php

    public function rank(array $candidates, User $user, ?float $alphaOverride = null): array
    {
        if ($candidates === []) {
            return [];
        }

        $postIds = array_keys($candidates);

        $rows = DB::table('posts')
            ->select([
                'id',
                'user_id',
                'created_at',
                DB::raw('embedding::text as embedding_text'),
            ])
            ->whereIn('id', $postIds)
            ->whereNotNull('embedding')
            ->get()
            ->keyBy('id');
---
select "id", "user_id", "created_at", embedding::text as embedding_text from "posts" where "id" in (166, 377, 263, 833, 719, 878, 629, 732, 445, 1150, 718, 1232, 1204, 469, 455, 888, 533, 947, 253, 1066, 468, 107, 92, 112, 174, 24, 971, 245, 32, 219, 108, 1, 211, 857, 185, 249, 236, 52, 667, 198, 36, 1203, 601, 812, 87, 220, 696, 1032, 213, 116, 730, 421, 700, 506, 472, 548, 1021, 65, 904, 861, 790, 519, 965, 592, 1128, 483, 322, 937, 571, 556, 401, 141, 450, 822, 451, 972, 782, 1243, 516, 1221, 17, 1035, 552, 1217, 837, 578, 168, 260, 221, 968, 14, 148, 528, 948, 433, 390, 1210, 394, 912, 1229, 520, 178, 1195, 339, 1215, 827, 151, 741, 1062, 876, 823, 398, 806, 517, 781, 160, 47, 359, 384, 761, 1172, 926, 345, 1226, 1095, 463, 575, 1152, 439, 534, 1127, 379, 908, 670, 843, 1029, 872, 626, 974, 980, 1120, 798, 231, 1019, 961, 614, 252, 596, 334, 1130, 669, 757, 910, 1239, 6, 946, 96, 38, 1219, 120, 217, 1162, 618, 287, 1100, 605, 229, 850, 797, 637, 658, 902, 783) and "embedding" is not null

    public function resolveAlpha(User $user): float
    {
        $default = (float) config('recommendation.score.alpha_default', 0.8);
        $activeAlpha = (float) config('recommendation.score.alpha_active_session', 0.3);
        $threshold = (int) config('recommendation.score.alpha_active_threshold', 5);

        $recentInteractions = DB::table('post_interactions')
            ->where('user_id', $user->id)
            ->where('created_at', '>=', now()->subHours(24))
            ->count();
---
select count(*) as aggregate from "post_interactions" where "user_id" = 302 and "created_at" >= '2026-04-21 00:08:31'