app/Services/Recommendation/RecommendationService.php

select count(*) as aggregate from "post_interactions" as "pi" inner join "interaction_types" as "it" on "it"."id" = "pi"."interaction_type_id" where "pi"."user_id" = 304 and "it"."is_positive" = 1
---
    private function promotedColdStartAlpha(User $user): ?float
    {
        if (! empty($user->long_term_embedding)) {
            return null;
        }

        $threshold = (int) config('recommendation.cold_start.interactions_threshold', 5);

        $positiveCount = DB::table('post_interactions as pi')
            ->join('interaction_types as it', 'it.id', '=', 'pi.interaction_type_id')
            ->where('pi.user_id', $user->id)
            ->where('it.is_positive', true)
            ->count();

select "id", "post_id", "user_id" from "likes" where "likes"."post_id" in (166, 245, 253, 263, 322, 401, 732, 783, 878, 1232)
select * from "post_types" where "post_types"."id" in (1, 2, 3)
---
    private function hydratePosts(array $postIds): Collection
    {
        if ($postIds === []) {
            return new Collection;
        }

        $ordering = array_flip($postIds);

        $posts = Post::query()
            ->with(['author', 'type', 'media', 'likes:id,post_id,user_id'])
            ->withCount(['likes', 'comments'])
            ->whereIn('id', $postIds)
            ->get();