app/Services/Recommendation/ViewSignalRecorder.php

    public function record(User $user, array $events, ?string $sessionId = null): int
    {
        $typeIdsBySlug = InteractionType::query()
            ->whereIn('slug', [ViewSignalCalculator::KIND_VIEW, ViewSignalCalculator::KIND_SKIP_FAST])
            ->pluck('id', 'slug');

        $created = 0;

        foreach ($events as $event) {
            $duration = (int) ($event['duration_ms'] ?? 0);
            $classification = ViewSignalCalculator::classify($duration);

            if ($classification === null) {
                continue;
            }

            $typeId = $typeIdsBySlug[$classification['kind']] ?? null;

            if ($typeId === null) {
                continue;
            }

            $occurredAt = isset($event['occurred_at']) && $event['occurred_at'] !== null
                ? Carbon::parse($event['occurred_at'])
                : now();

            PostInteraction::create([
                'user_id' => $user->id,
                'post_id' => (int) $event['post_id'],
                'interaction_type_id' => $typeId,
                'weight' => $classification['weight'],
                'session_id' => $sessionId,
                'duration_ms' => $duration,
                'context' => $event['context'] ?? null,
                'created_at' => $occurredAt,
            ]);
---
select "id", "slug" from "interaction_types" where "slug" in ('view', 'skip_fast')
insert into "post_interactions" ("user_id", "post_id", "interaction_type_id", "weight", "session_id", "duration_ms", "context", "created_at") values (304, 1122, 5, 0.23, '97abd669-1613-42f2-b5be-b254701fe238', 3701, null, '2026-04-22 00:40:52') returning "id"